/**
  ******************************************************************************
  * @file        : mymath.h
  * @author      : ZJY
  * @version     : V1.0
  * @date        : 2026-01-31
  * @brief       : 
  * @attention   : None
  ******************************************************************************
  * @history     :
  *         V1.0 : 添加实现向上取整函数
  ******************************************************************************
  */
#ifndef __MYMATH_H__
#define __MYMATH_H__

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/



/* Exported types ------------------------------------------------------------*/



/* Exported constants --------------------------------------------------------*/



/* Exported macros -----------------------------------------------------------*/
#define DIV_ROUND_UP(n,d)       (((n) + (d) - 1) / (d))

/**
 * @brief 64 位无符号整数进行除法运算时实现向上取整
 */
#define DIV_ROUND_UP_ULL(n, d)  (((unsigned long long)(n) + (d) - 1) / (d))

/* Exported variables --------------------------------------------------------*/



/* Exported functions --------------------------------------------------------*/



#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __MYMATH_H__ */
